In [1]:
import numpy as np 
import pandas as pd

In [8]:
sozluk1 = {"Isım" : ["Ahmet","Mehmet","Zeynep","Ali"],
          "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [100,200,300,400]}

In [9]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [10]:
dataFrame1

     Isım       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3     Ali  Basketbol     400

In [11]:
sozluk2 = {"Isım" : ["Osman","Levent","Atlas","Fatma"],
          "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [200,150,300,450]}

In [12]:
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [13]:
sozluk3 = {"Isım" : ["Ayşe","Mahmut","Duygu","Nur"],
          "Spor" : ["Koşu","Yüzme","Badminton","Tenis"],
          "Kalori" : [350,450,400,100]}

In [14]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [15]:
dataFrame2

     Isım       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     150
6   Atlas       Koşu     300
7   Fatma  Basketbol     450

In [16]:
dataFrame3

      Isım       Spor  Kalori
8     Ayşe       Koşu     350
9   Mahmut      Yüzme     450
10   Duygu  Badminton     400
11     Nur      Tenis     100

## concatenation

In [20]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isım       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3      Ali  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     150
6    Atlas       Koşu     300
7    Fatma  Basketbol     450
8     Ayşe       Koşu     350
9   Mahmut      Yüzme     450
10   Duygu  Badminton     400
11     Nur      Tenis     100

## merging / merge

In [21]:
mergeSozluk1 = {"Isım":["Ahmet","Mehmet","Zeynep","Ali"],
               "Spor":["Koşu","Yüzme","Koşu","Basketbol"]
               }

In [22]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [23]:
mergeDataFrame1

     Isım       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3     Ali  Basketbol

In [24]:
mergeSozluk2 = {"Isım":["Ahmet","Mehmet","Zeynep","Ali"],
               "Kalori":[100,200,150,250]
               }

In [25]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [26]:
mergeDataFrame2

     Isım  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3     Ali     250

In [29]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isım")

     Isım       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3     Ali  Basketbol     250

In [30]:
maasSozluk = {"Isım":["Ali","Zeynep","Mehmet","Ashmet"],
             "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas":[200,300,400,500]
             }

In [31]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [32]:
maasDataFrame

     Isım  Departman  Maas
0     Ali    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3  Ashmet    Yazılım   500

In [33]:
maasDataFrame["Departman"].uniqueque()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [36]:
maasDataFrame["Departman"].nunique()

3

In [37]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [40]:
def bruttenNete(maas):
    return maas * 0.66

In [41]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [42]:
maasDataFrame.isnull()

    Isım  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [47]:
yeniBirVeri = {"Karakter Sinifi":["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
               "Karakter Yasi":[9,10,50,20,10]
              }

In [48]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [49]:
karakterDF

  Karakter Sinifi Karakter Ismi  Karakter Yasi
0      South Park       Cartman              9
1      South Park         Kenny             10
2         Simpson         Homer             50
3         Simpson          Bart             20
4         Simpson          Bart             10

In [51]:
karakterDF.pivot_table(values = "Karakter Yasi", index = ["Karakter Sinifi","Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yasi
Karakter Sinifi Karakter Ismi
Simpson         Bart                      30
                Homer                     50
South Park      Cartman                    9
                Kenny                     10